// * ------------------------------
// *
// * 日本語/日语/Japanese
// *
// * ------------------------------
import type { IStringObj } from '../../types'

const ja: IStringObj = {
  i18n: 'JA',
  homepage: 'ホームページ',
  total: 'トータル',
  noData: '該当データはありません!',
  sreach: '検索',
  skillType: '技術分類',
  offical: '日本語公式',
  about: '関連：',
  download: '「マイスキル」 エクスポート',
  close: 'もどる',
  delete: '削除',
  skillName: '技術名称',
  businessEX: '実務経験（年）',
  personalEX: '個人経験（年）',
  mySKill: '早速「マイスキル」をスタァしましょう!',
  inquiry: 'お問い合わせ',
  disclaimer: '免責事項',
  dtBehavior: '皆様へ',
  dcBehavior: 'この免責事項をご一読ください、このサイトを使用すると、このページのすべての情報に同意、承諾するようになります。',
  dtCopyright: '著作権について',
  dcCopyright:
    'Front-End-Collection (FEC)によって公開されたテキスト、アイコン、サイトURLを含むすべてのコンテンツは、インターネットから収集されます（詳細は「コンテンツについて」を参照してください）。 FECが提供するコンテンツは、個人的な学習、調査を目的としています、内容の正確性は保証しません。このサイトのコンテンツ使用に伴うリスクは、このサイトとは何の関係もありません。訪問者は、個人的な学習、研究およびその他の非営利の目的のために、このサイトが提供するコンテンツを使用することができますが、同時に、著作権法および他の関連法律規定を遵守するものとして、このサイトおよび関連する債権者の法的権利を侵害してはいけません。 ',
  dtSource: 'コンテンツについて',
  dcSource:
    'このサイトで使用されているアイコンは、Simple Icons (https://simpleicons.org) でそのライセンスに遵守しています。技術の説明は、各技術の公式サイト（機械翻訳を含む）、Wikipedia、MDN から取得されます。関連サイトは、検索エンジンの検索から取得されます。',
  dtContact: '連絡先情報',
  dcContact:
    'このサイトは主に個人とコミュニティによって維持されていて、ライブラリに依存しているため、一部の情報は古くなっている可能性があります。情報が古くなっている場合は、以下のGitHubリポジトリでissueを報告してください。このサイトのコンテンツの元の作成者がこのサイトでコンテンツを公開することを望まない場合は、以下のGitHubリポジトリでissueを報告するか、メールアドレスに連絡してお願いいたします。',
  dtAbout: 'このサイトについて',
  dcAbout: 'Next.jsによって開発した個人学習を目的としたWebサイトです。',
}

export default ja
