// * ------------------------------
// *
// * 日本語/日语/Japanese
// *
// * ------------------------------
import type { IStringObj } from '../../types'

const ja: IStringObj = {
  i18n: 'JA',
  homepage: 'ホームページ',
  total: 'トータル',
  noData: '該当データはありません !',
  sreach: '検索',
  skillType: '技術分類',
  offical: '日本語公式',
  about: '関連',
  downloadTitle: 'マイスキル',
  download: 'エクスポート',
  close: 'もどる',
  delete: '削除',
  skillName: '技術名称',
  businessEX: '実務経験（年）',
  personalEX: '個人経験（年）',
  mySKill: '経験あるスキルを選択、経験期間を設定、職務経歴書で活用できる「マイスキル」のMarkDownファイルが出力できます。早速「マイスキル」を作りましょう !',
  description: '',
  issue: 'Report Issues',
  twitter: 'フロントエンド技術コレクションサイトFEC: ',
  inquiry: 'お問い合わせ',
  disclaimer: '免責事項',
  dtBehavior: '訪問者の皆様へ',
  dcBehavior:
    '当サイトを利用される場合は、ここに記載した条件に準拠いただくものとします。当サイトをご利用いただいた時点で、以下利用条件の全てに同意頂いたものとさせて頂きます。',
  dtCopyright: '著作権について',
  dcCopyright:
    '当サイト（Front-End-Collection、略FEC）によって公開されたテキスト、URLのすべてのコンテンツは、インターネットから収集されます（詳細は「コンテンツについて」を参照してください）。 当サイトが提供するコンテンツは、個人的な学習、調査を目的としています、コンテンツが正確であるかどうか、最新のものであるかどうか、安全なものであるか等について保証をするものではありません。当サイトのコンテンツ使用に伴うリスクは、当サイトと何らの責任を負うものではありません。訪問者は個人的な学習、研究および他の非営利の目的としている同時に、ライセンス、著作権法および他の関連法律規定を遵守するものとして、当サイト、または第三者に損害や不利益を与える行為、信用や名誉を損なう行為は禁止とさせて頂きます。',
  dtSource: 'コンテンツについて',
  dcSource:
    '当サイトはSimple Icons（https://simpleicons.org） のライセンスに遵守した上でアイコンとその色を使用しています。技術説明は各技術の公式サイト、Wikipedia、MDN、BaiduBaike（機械翻訳を含む）から取得されます。関連サイトは検索エンジンの検索から取得されます。',
  dtContact: '連絡先情報',
  dcContact:
    '当サイトはOSSプロジェクトで外部ラブライブに依存しているため、情報は古くなっている可能性があります。情報が古くなっている場合は、以下のGitHubでissueをしてお願いします。コンテンツの元の作成者がこのサイトでコンテンツを公開することを望まない場合は、以下のGitHubか、メールに連絡してお願いします。',
  dtAbout: 'このサイトについて',
  dcAbout: 'Next.jsによって開発した個人学習を目的としたWebサイトです。',
}

export default ja
